---
type: PresetInitialColor
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 2
tags: [revit-api, class]
---

# PresetInitialColor

`Autodesk.Revit.DB.Lighting.PresetInitialColor` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PresetInitialColor | — | `` |
| Property | Preset | 2013 | `public ColorPreset Preset { get ; set ; }` |